tap "abuxton/tap"
tap "busser/tap"
tap "carljavier/apps", "git@github.com:carljavier/homebrew-carljavier.git"
tap "derailed/k9s"
tap "golangci/tap"
tap "hashicorp/internal", "git@github.com:hashicorp/homebrew-internal.git"
tap "hashicorp/security", "git@github.com:hashicorp/homebrew-security.git"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "jameswoolfenden/tap"
tap "jesseduffield/lazydocker"
tap "jsoconno/terraflow"
tap "liamg/tfsec"
tap "minio/stable"
tap "nikaro/tap"
tap "overmindtech/overmind"
tap "puppetlabs/puppet"
tap "replicatedhq/replicated"
tap "romkatv/powerlevel10k"
tap "shihanng/tfvar"
tap "shipyard-run/repo"
tap "skanehira/docui"
tap "snyk/tap"
tap "thecasualcoder/stable"
tap "warrensbox/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally
brew "act"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Simple system information tool written in Python
brew "archey4"
# Record and share terminal sessions
brew "asciinema"
# Spell checker with better logic than ispell
brew "aspell"
# Configuration editing tool and API
brew "augeas"
# Text processing scripting language
brew "awk"
# AWS SDK for C++
brew "aws-sdk-cpp"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# Bring your existing Azure resources under the management of Terraform
brew "aztfexport"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Arbitrary precision numeric processing language
brew "bc"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Python code formatter
brew "black"
# Collection of portable C++ source libraries
brew "boost"
# Bash-Operated Reconciling Kludge
brew "bork"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Freely available high-quality data compressor
brew "bzip2"
# Platform built on V8 to build network applications
brew "node"
# Cloud Development Kit for Terraform
brew "cdktf"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Automated changelog tool for preparing releases
brew "changie"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Tool for service discovery, monitoring and configuration
brew "consul"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Top-like interface for container metrics
brew "ctop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# CLI tool to manage your devcontainers
brew "devc"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Produce graph of changes introduced by a diff file
brew "diffstat"
# File comparison utilities
brew "diffutils"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Replay stored shell commands for live presentations
brew "doitlive"
# More intuitive version of du in rust
brew "dust"
# Amazon EC2 AMI Tools (helps bundle Amazon Machine Images)
brew "ec2-ami-tools"
# Classic UNIX line editor
brew "ed", link: true
# Functional programming language for building browser-based GUIs
brew "elm"
# Launch process with environment variables from Consul and Vault
brew "envconsul"
# Program that can automate interactive applications
brew "expect"
# Library and command-line tool for SSH
brew "fabric"
# Installer for Fabric for the vanilla launcher
brew "fabric-installer"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Framework for layout and rendering of i18n text
brew "pango"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Utility to determine file types
brew "file-formula"
# File harvester to ship log files to Elasticsearch or Logstash
brew "filebeat"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Command-line utility for uploading Gists
brew "gist"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Easy semantic versioning for projects using Git
brew "gitversion"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Simplified Go project management, dependency management, and vendoring
brew "glide"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Apply a diff file to an original
brew "gpatch"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Image processing tools collection
brew "graphicsmagick"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# GNU troff text-formatting system
brew "groff"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Popular GNU data compression program
brew "gzip"
# Convert HCL2 to JSON
brew "hcl2json"
# Kubernetes package manager
brew "helm"
# Uses CSS selectors to extract bits content from HTML files
brew "htmlq"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Client library for huggingface.co hub
brew "huggingface-cli"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON to TSV converter
brew "json2tsv"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Build tool for Clojure
brew "leiningen"
# Pager program similar to more
brew "less"
# Conversion library
brew "libiconv"
# General purpose TCP-IP emulator
brew "libslirp"
# C virtualization API
brew "libvirt", restart_service: :changed
# C XSLT library for GNOME
brew "libxslt"
# High-performance, extensible alternative to ls
brew "lla"
# Utility to list open files
brew "lsof"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# MPEG audio decoder
brew "mad"
# Utility for directing compilation
brew "make"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Hash utilities
brew "md5sha1sum", link: false
# Run a Kubernetes cluster locally
brew "minikube"
# Project documentation with Markdown
brew "mkdocs"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Network grep
brew "ngrep"
# Distributed, Highly Available, Datacenter-Aware Scheduler
brew "nomad"
# Stream the output of any CLI and publish it to a variety of supported platforms
brew "notify"
# Simple CLI for interacting with Google oauth tokens
brew "oauth2l"
# Create, run, and share large language models (LLMs)
brew "ollama"
# API for decoding and seeking in .opus files
brew "opusfile"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Bash completion for Packer
brew "packer-completion"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Generate podman quadlet files from a podman command or compose file
brew "podlet"
# Tool for managing OCI containers and pods
brew "podman"
# Theme for zsh
brew "powerlevel10k"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Generic machine emulator and virtualizer
brew "qemu"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Utility that provides fast incremental file transfer
brew "rsync"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Work with remote images registries
brew "skopeo"
# SOcket CAT: netcat on steroids
brew "socat"
# SOund eXchange: universal sound sample translator
brew "sox"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id", link: true
# Command-line packet analyzer
brew "tcpdump"
# User interface to the TELNET protocol
brew "telnet"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Linter for Terraform files
brew "tflint"
# tfm cli -- Command Line Interface to migrate TFE workspace to TFC
brew "tfm"
# Framework for scalable cross-language services development
brew "thrift"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Bash completion for Vagrant
brew "vagrant-completion"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Lookup tool for domain names and other internet resources
brew "whois", link: true
# Show the current WiFi network password
brew "wifi-password"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Command-line fuzzy finder that prioritizes matches on filenames
brew "zf"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Tips, tricks, and examples for zsh
brew "zsh-lovers"
# Debugger for zsh
brew "zshdb"
# Display your Terraform module call stack
brew "busser/tap/tftree"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# Doormat CLI -- Command Line Interface to the Doormat Service
brew "hashicorp/security/doormat-cli"
# Boundary
brew "hashicorp/tap/boundary"
# Consul Enterprise
brew "hashicorp/tap/consul-enterprise", link: false
# Consul K8s
brew "hashicorp/tap/consul-k8s"
# hc-install CLI
brew "hashicorp/tap/hc-install"
# Hcdiag
brew "hashicorp/tap/hcdiag"
# Levant
brew "hashicorp/tap/levant"
# Nomad Enterprise
brew "hashicorp/tap/nomad-enterprise", link: false
# Nomad Pack
brew "hashicorp/tap/nomad-pack"
brew "hashicorp/tap/sentinel", link: false
# Vault
brew "hashicorp/tap/vault"
# Vault Enterprise
brew "hashicorp/tap/vault-enterprise", link: false
# Pike is a tool for determining the permissions or policy required for IAC code
brew "jameswoolfenden/tap/pike"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# A toolkit for making coding, documenting, and deploying Terraform simpler.
brew "jsoconno/terraflow/terraflow"
# Static analysis powered security scanner for your terraform code
brew "liamg/tfsec/tfsec"
# MinIO Client for object storage and filesystems
brew "minio/stable/mc"
# CLI to interact with the Overmind API
brew "overmindtech/overmind/overmind-cli"
# Package Replicated applications and manage releases, channels, customers and entitlements using a command-line interface.
brew "replicatedhq/replicated/cli"
# Terraform's variable definitions template generator.
brew "shihanng/tfvar/tfvar"
brew "shipyard-run/repo/shipyard"
# Find & fix known vulnerabilities in open-source dependencies
brew "snyk/tap/snyk"
# A command-line utility to print the summary of the terraform plan
brew "thecasualcoder/stable/tf-summarize"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Time-frequency browser
cask "baudline"
# Download programmes from the BBC iPlayer website
cask "bbc-iplayer-downloads"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Utility to create and modify archives
cask "betterzip"
# Client for the Box cloud storage service
cask "box-drive"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Web debugging Proxy application
cask "charles"
# API documentation browser and code snippet manager
cask "dash"
# Presentations from Markdown
cask "deckset"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Online diagram software
cask "drawio"
# Sci-fi themed terminal emulator and system monitor
cask "edex-ui"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Update maps and software, sync with Garmin Connect and register your device
cask "garmin-express"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
cask "hashicorp-boundary-desktop"
# Development environment
cask "hashicorp-vagrant"
# HTTP and GraphQL Client
cask "insomnia"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# End-to-end encryption software
cask "keybase"
# Control your environment from your keyboard
cask "lazy"
# Animated screen capture application
cask "licecap"
# Screen and video recording software
cask "loom"
# Cable-free audio router
cask "loopback"
# File system integration
cask "macfuse"
# Sandbox construction video game
cask "minecraft"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Home media player
cask "plex"
# OpenVPN client
cask "pritunl"
cask "puppet-agent"
# Native graphical client for the git version control system
cask "rowanj-gitx"
# GUI for rsync
cask "rsyncosx"
# Word processing software with a typewriter style
cask "scrivener"
# Language and framework for policy as code
cask "sentinel"
# Instant messaging application focusing on security
cask "signal"
# Digital design and prototyping platform
cask "sketch"
# Video chat, voice call and instant messaging application
cask "skype"
# Code-based music creation and performance tool
cask "sonic-pi"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Command-line client for Steam
cask "steamcmd"
# Controls screen display settings
cask "switchresx"
# Messaging app with a focus on speed and security
cask "telegram"
# File transfer application
cask "transmit"
cask "vagrant-manager"
# Gives Vagrant VMware plugin access to various VMware functionalities
cask "vagrant-vmware-utility"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "1Password 7", id: 1333542190
mas "Air Display", id: 419449718
mas "Apple Configurator", id: 1037126344
mas "Deckset", id: 847496013
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "accuricsinc.terrascan-rego-editor"
vscode "ahmadalli.vscode-nginx-conf"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bbenoist.vagrant"
vscode "brandontosch.hiera-eyaml"
vscode "caponetto.vscode-diff-viewer"
vscode "castwide.solargraph"
vscode "compilenix.vscode-zonefile"
vscode "cordsen.ssync-files"
vscode "d4nyll.devops-extension-pack"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "eriklynd.json-tools"
vscode "felipecaputo.git-project-manager"
vscode "formulahendry.docker-explorer"
vscode "foxundermoon.shell-format"
vscode "funkyremi.vscode-google-translate"
vscode "george-alisson.html-preview-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab-ci-hackathon.gitlabciviewer"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "gruntfuggly.todo-tree"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "hashicorp.hcl"
vscode "hashicorp.sentinel"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "henriiik.docker-linter"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "ipedrazas.kubernetes-snippets"
vscode "ivory-lab.jenkinsfile-support"
vscode "jgsqware.gitlab-ci-templates"
vscode "kaisun.vscodevimacademy"
vscode "kindy.rego"
vscode "mads-hartmann.bash-ide-vscode"
vscode "magnobiet.docker-extension-pack"
vscode "marcostazi.vs-code-vagrantfile"
vscode "marklarah.pre-commit-vscode"
vscode "matheusq94.tfs"
vscode "mindginative.terraform-snippets"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "naco-siren.gradle-language"
vscode "njpwerner.autodocstring"
vscode "owenfarrell.vscode-vault"
vscode "p1c2u.docker-compose"
vscode "pjmiravalle.terraform-advanced-syntax-highlighting"
vscode "plex.vscode-regolint"
vscode "qezhu.gitlink"
vscode "randomchance.logstash"
vscode "raynigon.nginx-formatter"
vscode "redhat.ansible"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rogalmic.bash-debug"
vscode "rogalmic.zsh-debug"
vscode "run-at-scale.terraform-doc-snippets"
vscode "sahmed.terraform-comments-beautifier"
vscode "shakram02.bash-beautify"
vscode "shopify.ruby-lsp"
vscode "softwaredotcom.music-time"
vscode "softwaredotcom.swdc-100-days-of-code"
vscode "softwaredotcom.swdc-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "subratthakur.remark-preview"
vscode "tsandall.opa"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "william-voyek.vscode-nginx"
vscode "wmontalvo.vsc-jsonsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "ziishaned.livereload"
