tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "puppetlabs/puppet"
brew "ack"
brew "archey"
brew "openssl"
brew "sqlite"
brew "python"
brew "asciinema"
brew "awk"
brew "aws-shell"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bc"
brew "bfg"
brew "boost"
brew "bzip2"
brew "cloc"
brew "cmake", link: false
brew "curl"
brew "diff-so-fancy"
brew "diffstat"
brew "diffutils"
brew "ec2-ami-tools"
brew "ec2-api-tools"
brew "ed"
brew "elm"
brew "expect"
brew "ffmpeg"
brew "file-formula"
brew "filebeat"
brew "findutils"
brew "gnu-tar"
brew "gnupg", link: false
brew "go"
brew "gpatch"
brew "gpg-agent"
brew "graphicsmagick"
brew "grep"
brew "groff"
brew "gzip"
brew "node"
brew "heroku"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "leiningen"
brew "less"
brew "libxml2"
brew "libxslt"
brew "lsof"
brew "lua"
brew "luajit"
brew "mad"
brew "make"
brew "mas"
brew "md5sha1sum"
brew "minimesos"
brew "nano"
brew "p7zip"
brew "packer"
brew "pandoc"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "rsync"
brew "ruby", link: true
brew "screen"
brew "shellcheck"
brew "source-to-image"
brew "sox"
brew "ssh-copy-id"
brew "tcpdump"
brew "telnet"
brew "tfenv"
brew "thefuck"
brew "thrift"
brew "tmux"
brew "tree"
brew "unrar"
brew "unzip"
brew "watch"
brew "wget", args: ["with-gpgme"]
brew "whois"
brew "youtube-dl"
brew "zlib"
brew "zsh"
cask "1password"
cask "alfred"
cask "atom"
cask "bettertouchtool"
cask "betterzip"
cask "busycal"
cask "cathode"
cask "charles"
cask "dash"
cask "docker"
cask "firefox"
cask "fuse"
cask "google-chrome-canary"
cask "insomnia"
cask "istat-menus"
cask "java"
cask "kitematic"
cask "licecap"
cask "rowanj-gitx"
cask "sketch"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "switchresx"
cask "telegram"
cask "toggl-beta"
cask "transmit"
cask "vagrant"
cask "whatsapp"
cask "xquartz"
cask "zoomus"
cask "puppetlabs/puppet/pdk"
cask "puppetlabs/puppet/puppet-bolt"
mas "", id: 497799835
mas "", id: 715768417
mas "", id: 1295203466
