tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "liamg/tfsec"
tap "puppetlabs/puppet"
tap "skanehira/docui"
brew "ack"
brew "archey"
brew "sqlite"
brew "asciinema"
brew "aspell"
brew "augeas"
brew "awk"
brew "aws-sdk-cpp"
brew "aws-shell"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bc"
brew "bfg"
brew "boost"
brew "bzip2"
brew "python"
brew "cloc"
brew "cmake"
brew "consul"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "diffstat"
brew "diffutils"
brew "ec2-ami-tools"
brew "ec2-api-tools"
brew "ed"
brew "elm"
brew "expect"
brew "ffmpeg"
brew "file-formula"
brew "filebeat"
brew "findutils"
brew "gcc"
brew "gist"
brew "git-secrets"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "gpatch"
brew "graphicsmagick"
brew "grep"
brew "groff"
brew "gzip"
brew "helm"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli", link: false
brew "leiningen"
brew "less"
brew "libiconv"
brew "libxml2"
brew "libxslt"
brew "lsof"
brew "lua"
brew "luajit"
brew "mad"
brew "make"
brew "mas"
brew "md5sha1sum", link: false
brew "minikube", link: false
brew "minimesos"
brew "nano"
brew "node"
brew "p7zip"
brew "packer"
brew "packer-completion"
brew "pkg-config"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "rsync"
brew "screen"
brew "shellcheck"
brew "sox"
brew "ssh-copy-id", link: true
brew "tcpdump"
brew "telnet"
brew "terragrunt"
brew "tfenv"
brew "thefuck"
brew "thrift"
brew "tmux"
brew "tree"
brew "unrar"
brew "unzip"
brew "vault"
brew "wget"
brew "whois"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-lovers"
brew "zsh-navigation-tools"
brew "zshdb"
brew "jesseduffield/lazydocker/lazydocker"
brew "liamg/tfsec/tfsec"
brew "skanehira/docui/docui"
cask "1password"
cask "airdisplay"
cask "bettertouchtool"
cask "betterzip"
cask "box-drive"
cask "caffeine"
cask "charles"
cask "dash"
cask "deckset"
cask "discord"
cask "docker"
cask "drawio"
cask "dropbox"
cask "edex-ui"
cask "firefox"
cask "gitter"
cask "google-chrome"
cask "google-cloud-sdk"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "java"
cask "licecap"
cask "osxfuse"
cask "plex"
cask "pritunl"
cask "rowanj-gitx"
cask "rsyncosx"
cask "sentinel"
cask "sketch"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "switchresx"
cask "telegram"
cask "transmit"
cask "vagrant"
cask "visual-studio-code"
cask "vmware-fusion"
cask "whatsapp"
cask "wkhtmltopdf"
cask "xquartz"
cask "zoomus"
mas "1Password 7", id: 1333542190
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
